<!-- dflook/terraform-github-actions {"workspace":"destroy","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"a462bb8871508068888b2b3aac1422eb3920cc9f7190e0e41ef386de75f1d46e","plan_job_ref":"Job Test plan target and replace #322 at https://github.com/dflook/terraform-github-actions/actions/runs/4295140085","plan_hash":"df92b3895bd736f953e358ab558b8f7925f9b077d8c9562b3850f19fbbd787ce","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __destroy__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "ceIo8K0sdV" -> (known after apply)
  ~ foreach = "gMyIV8hI4T" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #322](https://github.com/dflook/terraform-github-actions/actions/runs/4295140085)